
########
include("AAABK_Baseline.jl")
using Main.AAABK_Baseline
using BenchmarkTools

λ =  1.131874350361868
ψ =  0.037175089899834
ν =  0.205622086535123
α =  0.925520992611854
ϕ =  0.216311889844990
θL=  1.390807772162332
θH=  1.751156379867318
θE=  0.023600456924424
ε =  2.900000000000000
ρ =  0.020000000000000
γ =  0.500000000000000
γE=  0.500000000000000
σ =  2.000000000000000
Ls=  0.165500000000000
ω =  1.0


p = Params(λ,ψ,ν, α, ϕ, θL, θH, θE, ε, ρ, γ, γE, σ, Ls, ω)

eq,res = solveBGP(p);
@benchmark eq,res = solveBGP(p);
