
# Solving the baseline version of the model with estimated parameters
using Revise
using AAABK2018
using BenchmarkTools

# parameters
λ =  1.131874350361868; ψ =  0.037175089899834; ν =  0.205622086535123
α =  0.925520992611854; ϕ =  0.216311889844990; θˡ=  1.390807772162332
θʰ=  1.751156379867318; θᴱ=  0.023600456924424; ε =  2.900000000000000
ρ =  0.020000000000000; γ =  0.500000000000000; γᴱ=  0.500000000000000
σ =  2.000000000000000; Lˢ=  0.165500000000000; ω =  1.0

p = Params(λ,ψ,ν, α, ϕ, θˡ, θʰ, θᴱ, ε, ρ, γ, γᴱ, σ, Lˢ, ω)

# initial guess for equilibirum objects
eqInit = [ 1.9198743429837333, 0.5503951853312194, 0.06279563047969441,
           0.7151009125087638, 0.8361141441649012, 1.7322094255709095]

# solve
@benchmark eq,res = solveBGP(p,eqInit)